signup = '''привет, {name}!
я бот, использующий нейросети чтобы помочь тебе развить свою память.
Пожалуйста, введи /register и пройди регистрацию, чтобы работать со мной)'''
greet = '''привет, {name}!
я бот, использующий нейросети чтобы помочь тебе развить свою память.
задавай мне вопросы и я постараюсь ответить ☺️'''
menu = "📍 главное меню"

name_registration = 'Начинаем регистрацию, введите свое имя пожалуйста'
forename_registration = 'Записал! Введите свою фамилию'
group_registration = 'Записал! Введите свою учебную группу'
ending_registration = 'Вы зарегистрированы! Теперь вам доступна работа с ботом'
error_registration = 'Это непохоже на корректные данные(( Повторите ввод, пожалуйста'
already_registered = 'Вы уже зарегестрированы' 
